# =========================================== 1 задание =============================================================


a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))

summ = a + b + c
product = a * b * c

print("Сумма чисел:", summ)
print("Произведение чисел:", product)

# =========================================== 2 задание =============================================================


gross = float(input("введите зп:"))
credit = float(input("введите платеж за кредит:"))
home = float(input("введите долг за коммуналку:"))

summ = gross - credit - home

print("осталось:", summ)


# =========================================== 3 задание =============================================================


d1 = int(input("введите длину 1 диагонали:"))
d2 = int(input("введите длину 2 диагонали:"))

area = (d1*d2)/2

print("площадь ромба:", area)


# =========================================== 4 задание =============================================================

print("To be", "or not" , "to be" , sep ='\n' , end= ' ')

# =========================================== 5 задание ==============================================================

print("'Life is what happens\n  when\n    you're busy making other plans'\n      John Lennon.")
