# # ============================== 1 задание =============================================

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))

choice = input("выберите 'сумма' или 'произвдение': ")

if choice == 'сумма':
 print("СУММА:" , a + b + c)
elif choice == 'произведение':
 print("ПРОИЗВЕДЕНИЕ:" , a * b * c)
else:
    print("ошибка, выберите сумму или произведение:")

# # ================================== 2 задание =======================================

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))

choice = input("выберите 'максимум' или 'минимум' или 'среднее арифметическое': ")

if choice == 'максимум':
 print("максимум:", max(a, b, c))
elif choice == 'минимум':
     print("минимум:" , min(a, b, c))
elif choice == 'среднее арифметическое':
   print("СРЕДНЕЕ АРИФМЕТИЧЕСКОЕ:" , (a + b + c) /3)
else:
    print("ошибка, выберите минимум или максимум или среднее арифмитическое:")

# # ================================== 3 задание =======================================

meters = float(input("Введите количество метров: "))

choice = input("Выберите 'ярды', 'дюймы' или 'мили': ")

if choice == 'мили':
    print("Получилось:", round(meters * 0.000621371, 2))
elif choice == 'дюймы':
    print("Получилось:", round(meters * 39.3701, 2))
elif choice == 'ярды':
    print("Получилось:", round(meters * 1.09361, 2))
else:
    print("Ошибка, выберите: 'ярды', 'мили' или 'дюймы'")
